rewrite readme for first-screen impact
